benchmarks/filesystem/mcpeval.yaml
$schema: ../../schema/mcpeval.config.schema.json
name: Filesystem MCP Server Test Suite
description: Comprehensive evaluation of the MCP filesystem server capabilities
mcp:
  servers:
    filesystem:
      transport: stdio
      command: npx
      args:
      - -y
      - '@modelcontextprotocol/server-filesystem'
      env:
        NODE_ENV: development
provider: anthropic
model: claude-sonnet-4-20250514
default_agent: filesystem_agent
agents:
  definitions:
  - name: filesystem_agent
    instruction: 'You are a file management assistant that can perform filesystem
      operations

      like reading, writing, and organizing files. Handle errors gracefully.

      '
    server_names:
    - filesystem
    max_iterations: 10
judge:
  min_score: 0.8
  max_tokens: 2000
  system_prompt: 'You are an expert evaluator of file management tasks. Consider accuracy,
    completeness, error handling, and efficiency. '
  provider: anthropic
  model: claude-sonnet-4-20250514
metrics:
  collect:
  - response_time
  - total_duration
  - iteration_count
  - tool_coverage
  - tool_success_rate
  - unique_tools_used
  - unique_servers_used
  - parallel_tool_calls
  - max_concurrent_operations
  - token_usage
  - input_tokens
  - output_tokens
  - cost_estimate
  - llm_time
  - tool_time
  - reasoning_time
  - idle_time
  - error_count
  - error_rate
  - success_rate
  - path_efficiency_score
  - content_extraction_quality
  - error_recovery
reporting:
  formats:
  - json
  - markdown
  output_dir: ./test-reports
  include_traces: true
execution:
  max_concurrency: 3
  timeout_seconds: 120
  retry_failed: false